xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_lcd.h
/** @defgroup LCD_ScanFrequency LCD Scan Frequency
  * @{
  */
  
#define LCD_SCAN_FREQ_64HZ               ((uint32_t)0x00000000U)                /* LCD Scan Frequency 64Hz */
#define LCD_SCAN_FREQ_128HZ              (LCD_CR_LCDCLK_0)                      /* LCD Scan Frequency 128Hz */
#define LCD_SCAN_FREQ_256HZ              (LCD_CR_LCDCLK_1)                      /* LCD Scan Frequency 256Hz */
#define LCD_SCAN_FREQ_512HZ              (LCD_CR_LCDCLK_1 | LCD_CR_LCDCLK_0)    /* LCD Scan Frequency 512Hz */

/**
  * @}
  */

/** @defgroup LCD_Bias LCD Bias
  * @{
  */
  
#define LCD_BIAS_1_4                    ((uint32_t)0x00000000U) /*!< 1/4 Bias */
#define LCD_BIAS_1_2                    (LCD_CR_BIAS_0)         /*!< 1/2 Bias */
#define LCD_BIAS_1_3                    (LCD_CR_BIAS_1)         /*!< 1/3 Bias */

/**
  * @}
  */

/** @defgroup LCD_Duty LCD Duty
  * @{
  */
  
#define LCD_DUTY_STATIC                 ((uint32_t)0x00000000U)                           /*!< Static duty */
#define LCD_DUTY_1_2                    (LCD_CR_DUTY_0)                                   /*!< 1/2 duty    */
#define LCD_DUTY_1_3                    (LCD_CR_DUTY_1)                                   /*!< 1/3 duty    */
#define LCD_DUTY_1_4                    (LCD_CR_DUTY_1 | LCD_CR_DUTY_0)                   /*!< 1/4 duty    */
#define LCD_DUTY_1_6                    (LCD_CR_DUTY_2 | LCD_CR_DUTY_0)                   /*!< 1/6 duty    */
#define LCD_DUTY_1_8                    (LCD_CR_DUTY_2 | LCD_CR_DUTY_1 | LCD_CR_DUTY_0)   /*!< 1/8 duty    */

/**
  * @}
  */ 

/** @defgroup LCD_BiasSource LCD Bias Source
  * @{
  */

#define LCD_BIAS_SOURCE_INTERNAL_RESISTANCE                 ((uint32_t)0x00000000U)          /* Internal resistance mode */
#define LCD_BIAS_SOURCE_EXTERNAL_RESISTANCE                 (LCD_CR_BSEL_0)                  /* External resistance mode */
#define LCD_BIAS_SOURCE_EXTERNAL_CAPACITANCE                (LCD_CR_BSEL_1)                  /* External capacitance mode */

/**
  * @}
  */

/** @defgroup LCD_Contrast LCD Contrast
  * @{
  */

#define LCD_CONTRASTLEVEL_0               ((uint32_t)0x00000000U)
#define LCD_CONTRASTLEVEL_1               (LCD_CR_CONTRAST_0)
#define LCD_CONTRASTLEVEL_2               (LCD_CR_CONTRAST_1)
#define LCD_CONTRASTLEVEL_3               (LCD_CR_CONTRAST_1 | LCD_CR_CONTRAST_0)
#define LCD_CONTRASTLEVEL_4               (LCD_CR_CONTRAST_2)
#define LCD_CONTRASTLEVEL_5               (LCD_CR_CONTRAST_2 | LCD_CR_CONTRAST_0)
#define LCD_CONTRASTLEVEL_6               (LCD_CR_CONTRAST_2 | LCD_CR_CONTRAST_1)
#define LCD_CONTRASTLEVEL_7               (LCD_CR_CONTRAST_2 | LCD_CR_CONTRAST_1 | LCD_CR_CONTRAST_0)
#define LCD_CONTRASTLEVEL_8               (LCD_CR_CONTRAST_3)
#define LCD_CONTRASTLEVEL_9               (LCD_CR_CONTRAST_3 | LCD_CR_CONTRAST_0)
#define LCD_CONTRASTLEVEL_10              (LCD_CR_CONTRAST_3 | LCD_CR_CONTRAST_1)
#define LCD_CONTRASTLEVEL_11              (LCD_CR_CONTRAST_3 | LCD_CR_CONTRAST_1 | LCD_CR_CONTRAST_0)
#define LCD_CONTRASTLEVEL_12              (LCD_CR_CONTRAST_3 | LCD_CR_CONTRAST_2)
#define LCD_CONTRASTLEVEL_13              (LCD_CR_CONTRAST_3 | LCD_CR_CONTRAST_2 | LCD_CR_CONTRAST_0)
#define LCD_CONTRASTLEVEL_14              (LCD_CR_CONTRAST_3 | LCD_CR_CONTRAST_2 | LCD_CR_CONTRAST_1)
#define LCD_CONTRASTLEVEL_15              (LCD_CR_CONTRAST_3 | LCD_CR_CONTRAST_2 | LCD_CR_CONTRAST_1 | LCD_CR_CONTRAST_0)

/**
  * @}
  */

/** @defgroup LCD_Voltage_Source LCD Voltage Source
  * @{
  */

#define LCD_VOLTAGE_SOURCE_VCCA         ((uint32_t)0x00000000U)                                                          /*VCCA */
#if defined(LCD_CR_VSEL)
#define LCD_VOLTAGE_SOURCE_2P6          (LCD_CR_VSEL)                                                               /* 2.6V VCP SEL */
#define LCD_VOLTAGE_SOURCE_2P74         (LCD_CR_VSEL | LCD_CR_VCP_SEL_0)                                            /* 2.74V VCP SEL */
#define LCD_VOLTAGE_SOURCE_2P88         (LCD_CR_VSEL | LCD_CR_VCP_SEL_1)                                            /* 2.88V VCP SEL */
#define LCD_VOLTAGE_SOURCE_3P02         (LCD_CR_VSEL | LCD_CR_VCP_SEL_0 | LCD_CR_VCP_SEL_1)                         /* 3.02V VCP SEL */
#define LCD_VOLTAGE_SOURCE_3P16         (LCD_CR_VSEL | LCD_CR_VCP_SEL_2)                                            /* 3.16V VCP SEL */
#define LCD_VOLTAGE_SOURCE_3P3          (LCD_CR_VSEL | LCD_CR_VCP_SEL_2 | LCD_CR_VCP_SEL_0)                         /* 3.3V VCP SEL */
#define LCD_VOLTAGE_SOURCE_3P44         (LCD_CR_VSEL | LCD_CR_VCP_SEL_2 | LCD_CR_VCP_SEL_1)                         /* 3.44V VCP SEL */
#define LCD_VOLTAGE_SOURCE_3P58         (LCD_CR_VSEL | LCD_CR_VCP_SEL_2 | LCD_CR_VCP_SEL_1 | LCD_CR_VCP_SEL_0)      /* 3.58V VCP SEL */
#endif

/**
  * @}
  */

/** @defgroup LCD_ComSegDrive_Type LCD ComSegDrive Type
  * @{
  */

#define LCD_COMSEGDRIVE_TYPE_A             ((uint32_t)0x00000000)        /*!< LCD COM SEG Drive Type A */
#define LCD_COMSEGDRIVE_TYPE_B             (LCD_CR_COMSEG_DRV_TYPE)      /*!< LCD COM SEG Drive Type B */
/**
  * @}
  */

/** @defgroup LCD_FastCharge_Cycle LCD Fast Charge Cycle
  * @{
  */

#define LCD_FASTCHARGE_CYCLE_1_2        ((uint32_t)0x00000000U)             /* Fast Charge 1/2 LCD COM Cycle */
#define LCD_FASTCHARGE_CYCLE_1_4        (LCD_CR_FCCTL_0)                    /* Fast Charge 1/4 LCD COM Cycle */
#define LCD_FASTCHARGE_CYCLE_1_8        (LCD_CR_FCCTL_1)                    /* Fast Charge 1/8 LCD COM Cycle */
#define LCD_FASTCHARGE_CYCLE_1_16       (LCD_CR_FCCTL_0 | LCD_CR_FCCTL_1)   /* Fast Charge 1/16 LCD COM Cycle */
#define LCD_FASTCHARGE_CYCLE_1_32       (LCD_CR_FCCTL_2)                    /* Fast Charge 1/32 LCD COM Cycle */
#define LCD_FASTCHARGE_CYCLE_1_64       (LCD_CR_FCCTL_2 | LCD_CR_FCCTL_0)   /* Fast Charge 1/64 LCD COM Cycle */
#define LCD_FASTCHARGE_CYCLE_1_128      (LCD_CR_FCCTL_2 | LCD_CR_FCCTL_1)   /* Fast Charge 1/128 LCD COM Cycle */
/**
  * @}
  */

#if defined(LCD_CR_VSEL)
/** @defgroup LCD_ChargePump_Freq LCD ChargePump Freq
  * @{
  */
#define LCD_CHARGEPUMP_FREQ_512HZ          (0x00000000U)                                          /* ChargePump 512 Hz */
#define LCD_CHARGEPUMP_FREQ_1024HZ         (LCD_CR_CP_FRQ_0)                                       /* ChargePump 1024 Hz */
#define LCD_CHARGEPUMP_FREQ_2048HZ         (LCD_CR_CP_FRQ_1)                                       /* ChargePump 2048 Hz */
#define LCD_CHARGEPUMP_FREQ_4096HZ         (LCD_CR_CP_FRQ_0 | LCD_CR_CP_FRQ_1)                     /* ChargePump 4096 Hz */
#define LCD_CHARGEPUMP_FREQ_8192HZ         (LCD_CR_CP_FRQ_2)                                       /* ChargePump 8192 Hz */
#define LCD_CHARGEPUMP_FREQ_16384HZ        (LCD_CR_CP_FRQ_2 | LCD_CR_CP_FRQ_0)                     /* ChargePump 16384 Hz */
/**
  * @}
  */

/** @defgroup LCD_ChargePump_SetTime LCD ChargePump SetTime
  * @{
  */

#define LCD_CHARGEPUMP_SETTIME_256CLOCK          (0x00000000U)                                   /* ChargePump Settime 256 LSE/LSI Clocks  */                                
#define LCD_CHARGEPUMP_SETTIME_512CLOCK          (LCD_CR_CP_ST_0)                                /* ChargePump Settime 512 LSE/LSI Clocks  */
#define LCD_CHARGEPUMP_SETTIME_1024CLOCK         (LCD_CR_CP_ST_1)                                /* ChargePump Settime 1024 LSE/LSI Clocks  */
#define LCD_CHARGEPUMP_SETTIME_2048CLOCK         (LCD_CR_CP_ST_0 | LCD_CR_CP_ST_1)               /* ChargePump Settime 2048 LSE/LSI Clocks  */
/**
  * @}
  */
#endif

/** @defgroup LCD_DeadTime LCD Dead Time
  * @{
  */
#define LCD_DEAD_TIME_0                  (0x00000000U)                     /*!< No dead Time                                  */
#define LCD_DEAD_TIME_1                  (LCD_CR_DEAD_0)                   /*!< One Phase between different couple of Frame   */
#define LCD_DEAD_TIME_2                  (LCD_CR_DEAD_1)                   /*!< Two Phase between different couple of Frame   */
#define LCD_DEAD_TIME_3                  (LCD_CR_DEAD_1 | LCD_CR_DEAD_0)   /*!< Three Phase between different couple of Frame */
#define LCD_DEAD_TIME_4                  (LCD_CR_DEAD_2)                   /*!< Four Phase between different couple of Frame  */
#define LCD_DEAD_TIME_5                  (LCD_CR_DEAD_2 | LCD_CR_DEAD_0)   /*!< Five Phase between different couple of Frame  */
#define LCD_DEAD_TIME_6                  (LCD_CR_DEAD_2 | LCD_CR_DEAD_1)   /*!< Six Phase between different couple of Frame   */
#define LCD_DEAD_TIME_7                  (LCD_CR_DEAD)                     /*!< Seven Phase between different couple of Frame */
/**
  * @}
  */

/** @defgroup LCD_BlinkFrequency LCD Blink Frequency
  * @{
  */
#define LCD_BLINK_FREQ_OFF              (0x00000000U)                                                                                                                                         /*!< Blink disabled         */
#define LCD_BLINK_FREQ_DIV1             (LCD_CSR_BLINKEN                                                                                                                              )       /*!< Blink enabled 1/64     */
#define LCD_BLINK_FREQ_DIV2             (LCD_CSR_BLINKEN                                                                                                          | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 2/64     */
#define LCD_BLINK_FREQ_DIV3             (LCD_CSR_BLINKEN                                                                                     | LCD_CSR_BLINKCNT_1                     )       /*!< Blink enabled 3/64     */
#define LCD_BLINK_FREQ_DIV4             (LCD_CSR_BLINKEN                                                                                     | LCD_CSR_BLINKCNT_1 | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 4/64     */
#define LCD_BLINK_FREQ_DIV5             (LCD_CSR_BLINKEN                                                                | LCD_CSR_BLINKCNT_2                                          )       /*!< Blink enabled 5/64     */
#define LCD_BLINK_FREQ_DIV6             (LCD_CSR_BLINKEN                                                                | LCD_CSR_BLINKCNT_2                      | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 6/64     */
#define LCD_BLINK_FREQ_DIV7             (LCD_CSR_BLINKEN                                                                | LCD_CSR_BLINKCNT_2 | LCD_CSR_BLINKCNT_1                     )       /*!< Blink enabled 7/64     */
#define LCD_BLINK_FREQ_DIV8             (LCD_CSR_BLINKEN                                                                | LCD_CSR_BLINKCNT_2 | LCD_CSR_BLINKCNT_1 | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 8/64     */
#define LCD_BLINK_FREQ_DIV9             (LCD_CSR_BLINKEN                                           | LCD_CSR_BLINKCNT_3                                                               )       /*!< Blink enabled 9/64     */
#define LCD_BLINK_FREQ_DIV10            (LCD_CSR_BLINKEN                                           | LCD_CSR_BLINKCNT_3                                           | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 10/64     */
#define LCD_BLINK_FREQ_DIV11            (LCD_CSR_BLINKEN                                           | LCD_CSR_BLINKCNT_3                      | LCD_CSR_BLINKCNT_1                     )       /*!< Blink enabled 11/64     */
#define LCD_BLINK_FREQ_DIV12            (LCD_CSR_BLINKEN                                           | LCD_CSR_BLINKCNT_3                      | LCD_CSR_BLINKCNT_1 | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 12/64     */
#define LCD_BLINK_FREQ_DIV13            (LCD_CSR_BLINKEN                                           | LCD_CSR_BLINKCNT_3 | LCD_CSR_BLINKCNT_2                                          )       /*!< Blink enabled 13/64     */
#define LCD_BLINK_FREQ_DIV14            (LCD_CSR_BLINKEN                                           | LCD_CSR_BLINKCNT_3 | LCD_CSR_BLINKCNT_2                      | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 14/64     */
#define LCD_BLINK_FREQ_DIV15            (LCD_CSR_BLINKEN                                           | LCD_CSR_BLINKCNT_3 | LCD_CSR_BLINKCNT_2 | LCD_CSR_BLINKCNT_1                     )       /*!< Blink enabled 15/64     */
#define LCD_BLINK_FREQ_DIV16            (LCD_CSR_BLINKEN                                           | LCD_CSR_BLINKCNT_3 | LCD_CSR_BLINKCNT_2 | LCD_CSR_BLINKCNT_1 | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 16/64     */
#define LCD_BLINK_FREQ_DIV17            (LCD_CSR_BLINKEN                      | LCD_CSR_BLINKCNT_4                                                                                    )       /*!< Blink enabled 17/64     */
#define LCD_BLINK_FREQ_DIV18            (LCD_CSR_BLINKEN                      | LCD_CSR_BLINKCNT_4                                                                | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 18/64     */
#define LCD_BLINK_FREQ_DIV19            (LCD_CSR_BLINKEN                      | LCD_CSR_BLINKCNT_4                                           | LCD_CSR_BLINKCNT_1                     )       /*!< Blink enabled 19/64     */
#define LCD_BLINK_FREQ_DIV20            (LCD_CSR_BLINKEN                      | LCD_CSR_BLINKCNT_4                                           | LCD_CSR_BLINKCNT_1 | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 20/64     */
#define LCD_BLINK_FREQ_DIV21            (LCD_CSR_BLINKEN                      | LCD_CSR_BLINKCNT_4                      | LCD_CSR_BLINKCNT_2                                          )       /*!< Blink enabled 21/64     */
#define LCD_BLINK_FREQ_DIV22            (LCD_CSR_BLINKEN                      | LCD_CSR_BLINKCNT_4                      | LCD_CSR_BLINKCNT_2                      | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 22/64     */
#define LCD_BLINK_FREQ_DIV23            (LCD_CSR_BLINKEN                      | LCD_CSR_BLINKCNT_4                      | LCD_CSR_BLINKCNT_2 | LCD_CSR_BLINKCNT_1                     )       /*!< Blink enabled 23/64     */
#define LCD_BLINK_FREQ_DIV24            (LCD_CSR_BLINKEN                      | LCD_CSR_BLINKCNT_4                      | LCD_CSR_BLINKCNT_2 | LCD_CSR_BLINKCNT_1 | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 24/64     */
#define LCD_BLINK_FREQ_DIV25            (LCD_CSR_BLINKEN                      | LCD_CSR_BLINKCNT_4 | LCD_CSR_BLINKCNT_3                                                               )       /*!< Blink enabled 25/64     */
#define LCD_BLINK_FREQ_DIV26            (LCD_CSR_BLINKEN                      | LCD_CSR_BLINKCNT_4 | LCD_CSR_BLINKCNT_3                                           | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 26/64     */
#define LCD_BLINK_FREQ_DIV27            (LCD_CSR_BLINKEN                      | LCD_CSR_BLINKCNT_4 | LCD_CSR_BLINKCNT_3                      | LCD_CSR_BLINKCNT_1                     )       /*!< Blink enabled 27/64     */
#define LCD_BLINK_FREQ_DIV28            (LCD_CSR_BLINKEN                      | LCD_CSR_BLINKCNT_4 | LCD_CSR_BLINKCNT_3                      | LCD_CSR_BLINKCNT_1 | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 28/64     */
#define LCD_BLINK_FREQ_DIV29            (LCD_CSR_BLINKEN                      | LCD_CSR_BLINKCNT_4 | LCD_CSR_BLINKCNT_3 | LCD_CSR_BLINKCNT_2                                          )       /*!< Blink enabled 29/64     */
#define LCD_BLINK_FREQ_DIV30            (LCD_CSR_BLINKEN                      | LCD_CSR_BLINKCNT_4 | LCD_CSR_BLINKCNT_3 | LCD_CSR_BLINKCNT_2                      | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 30/64     */
#define LCD_BLINK_FREQ_DIV31            (LCD_CSR_BLINKEN                      | LCD_CSR_BLINKCNT_4 | LCD_CSR_BLINKCNT_3 | LCD_CSR_BLINKCNT_2 | LCD_CSR_BLINKCNT_1                     )       /*!< Blink enabled 31/64     */
#define LCD_BLINK_FREQ_DIV32            (LCD_CSR_BLINKEN                      | LCD_CSR_BLINKCNT_4 | LCD_CSR_BLINKCNT_3 | LCD_CSR_BLINKCNT_2 | LCD_CSR_BLINKCNT_1 | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 32/64     */
#define LCD_BLINK_FREQ_DIV33            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5                                                                                                         )       /*!< Blink enabled 33/64     */
#define LCD_BLINK_FREQ_DIV34            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5                                                                                     | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 34/64     */
#define LCD_BLINK_FREQ_DIV35            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5                                                                | LCD_CSR_BLINKCNT_1                     )       /*!< Blink enabled 35/64     */
#define LCD_BLINK_FREQ_DIV36            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5                                                                | LCD_CSR_BLINKCNT_1 | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 36/64     */
#define LCD_BLINK_FREQ_DIV37            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5                                           | LCD_CSR_BLINKCNT_2                                          )       /*!< Blink enabled 37/64     */
#define LCD_BLINK_FREQ_DIV38            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5                                           | LCD_CSR_BLINKCNT_2                      | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 38/64     */
#define LCD_BLINK_FREQ_DIV39            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5                                           | LCD_CSR_BLINKCNT_2 | LCD_CSR_BLINKCNT_1                     )       /*!< Blink enabled 39/64     */
#define LCD_BLINK_FREQ_DIV40            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5                                           | LCD_CSR_BLINKCNT_2 | LCD_CSR_BLINKCNT_1 | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 40/64     */
#define LCD_BLINK_FREQ_DIV41            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5                      | LCD_CSR_BLINKCNT_3                                                               )       /*!< Blink enabled 41/64     */
#define LCD_BLINK_FREQ_DIV42            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5                      | LCD_CSR_BLINKCNT_3                                           | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 42/64     */
#define LCD_BLINK_FREQ_DIV43            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5                      | LCD_CSR_BLINKCNT_3                      | LCD_CSR_BLINKCNT_1                     )       /*!< Blink enabled 43/64     */
#define LCD_BLINK_FREQ_DIV44            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5                      | LCD_CSR_BLINKCNT_3                      | LCD_CSR_BLINKCNT_1 | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 44/64     */
#define LCD_BLINK_FREQ_DIV45            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5                      | LCD_CSR_BLINKCNT_3 | LCD_CSR_BLINKCNT_2                                          )       /*!< Blink enabled 45/64     */
#define LCD_BLINK_FREQ_DIV46            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5                      | LCD_CSR_BLINKCNT_3 | LCD_CSR_BLINKCNT_2                      | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 46/64     */
#define LCD_BLINK_FREQ_DIV47            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5                      | LCD_CSR_BLINKCNT_3 | LCD_CSR_BLINKCNT_2 | LCD_CSR_BLINKCNT_1                     )       /*!< Blink enabled 47/64     */
#define LCD_BLINK_FREQ_DIV48            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5                      | LCD_CSR_BLINKCNT_3 | LCD_CSR_BLINKCNT_2 | LCD_CSR_BLINKCNT_1 | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 48/64     */
#define LCD_BLINK_FREQ_DIV49            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5 | LCD_CSR_BLINKCNT_4                                                                                    )       /*!< Blink enabled 49/64     */
#define LCD_BLINK_FREQ_DIV50            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5 | LCD_CSR_BLINKCNT_4                                                                | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 50/64     */
#define LCD_BLINK_FREQ_DIV51            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5 | LCD_CSR_BLINKCNT_4                                           | LCD_CSR_BLINKCNT_1                     )       /*!< Blink enabled 51/64     */
#define LCD_BLINK_FREQ_DIV52            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5 | LCD_CSR_BLINKCNT_4                                           | LCD_CSR_BLINKCNT_1 | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 52/64     */
#define LCD_BLINK_FREQ_DIV53            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5 | LCD_CSR_BLINKCNT_4                      | LCD_CSR_BLINKCNT_2                                          )       /*!< Blink enabled 53/64     */
#define LCD_BLINK_FREQ_DIV54            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5 | LCD_CSR_BLINKCNT_4                      | LCD_CSR_BLINKCNT_2                      | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 54/64     */
#define LCD_BLINK_FREQ_DIV55            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5 | LCD_CSR_BLINKCNT_4                      | LCD_CSR_BLINKCNT_2 | LCD_CSR_BLINKCNT_1                     )       /*!< Blink enabled 55/64     */
#define LCD_BLINK_FREQ_DIV56            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5 | LCD_CSR_BLINKCNT_4                      | LCD_CSR_BLINKCNT_2 | LCD_CSR_BLINKCNT_1 | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 56/64     */
#define LCD_BLINK_FREQ_DIV57            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5 | LCD_CSR_BLINKCNT_4 | LCD_CSR_BLINKCNT_3                                                               )       /*!< Blink enabled 57/64     */
#define LCD_BLINK_FREQ_DIV58            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5 | LCD_CSR_BLINKCNT_4 | LCD_CSR_BLINKCNT_3                                           | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 58/64     */
#define LCD_BLINK_FREQ_DIV59            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5 | LCD_CSR_BLINKCNT_4 | LCD_CSR_BLINKCNT_3                      | LCD_CSR_BLINKCNT_1                     )       /*!< Blink enabled 59/64     */
#define LCD_BLINK_FREQ_DIV60            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5 | LCD_CSR_BLINKCNT_4 | LCD_CSR_BLINKCNT_3                      | LCD_CSR_BLINKCNT_1 | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 60/64     */
#define LCD_BLINK_FREQ_DIV61            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5 | LCD_CSR_BLINKCNT_4 | LCD_CSR_BLINKCNT_3 | LCD_CSR_BLINKCNT_2                                          )       /*!< Blink enabled 61/64     */
#define LCD_BLINK_FREQ_DIV62            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5 | LCD_CSR_BLINKCNT_4 | LCD_CSR_BLINKCNT_3 | LCD_CSR_BLINKCNT_2                      | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 62/64     */
#define LCD_BLINK_FREQ_DIV63            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5 | LCD_CSR_BLINKCNT_4 | LCD_CSR_BLINKCNT_3 | LCD_CSR_BLINKCNT_2 | LCD_CSR_BLINKCNT_1                     )       /*!< Blink enabled 63/64     */
#define LCD_BLINK_FREQ_DIV64            (LCD_CSR_BLINKEN | LCD_CSR_BLINKCNT_5 | LCD_CSR_BLINKCNT_4 | LCD_CSR_BLINKCNT_3 | LCD_CSR_BLINKCNT_2 | LCD_CSR_BLINKCNT_1 | LCD_CSR_BLINKCNT_0)       /*!< Blink enabled 64/64     */

/**
  * @}
  */

/** @defgroup LCD_CapDrive_Number LCD CapDrive Number  
  * @{
  */

