xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_lcd.h
/** @brief  Clears the specified LCD pending flag.
  * @param  __HANDLE__ specifies the LCD Handle.
  * @param  __FLAG__ specifies the flag to clear.
  *        This parameter can be any combination of the following values:
  *        @arg LCD_FLAG_SOF: Start of Frame Flag
  *        @arg LCD_FLAG_UDD: Update Display Done FLag
  *        @arg LCD_FLAG_BKF: Blink Done Flag
  * @retval None
  */
#define __HAL_LCD_CLEAR_FLAG(__HANDLE__, __FLAG__)  (SET_BIT((__HANDLE__)->Instance->INTCLR, (__FLAG__)))

/** @brief  Enables or disables the LCD blink mode.
  * @param  __HANDLE__ specifies the LCD Handle.
  * @retval None
  */
#define __HAL_LCD_ENABLE_BLINK(__HANDLE__)      (SET_BIT((__HANDLE__)->Instance->CSR, LCD_CSR_BLINKEN))
#define __HAL_LCD_DISABLE_BLINK(__HANDLE__)     (CLEAR_BIT((__HANDLE__)->Instance->CSR, LCD_CSR_BLINKEN))

/** @brief  Configure the number of frames corresponding to LCD blink frequency and interrupt interval
  * @param  __HANDLE__ specifies the LCD Handle.
  * @param  __VALUE__ specifies the number of frames corresponding to LCD blink frequency and interrupt interval.
  * @retval None
  */
#define __HAL_LCD_BLINK_CONFIG(__HANDLE__, __VALUE__)   (MODIFY_REG((__HANDLE__)->Instance->CSR, LCD_CSR_BLINKCNT, (__VALUE__)))

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup LCD_Private_Macros LCD Private Macros
  * @{
  */

#define IS_LCD_SCAN_FREQ(__FREQ__)     (((__FREQ__) == LCD_SCAN_FREQ_64HZ) || \
                                        ((__FREQ__) == LCD_SCAN_FREQ_128HZ) || \
                                        ((__FREQ__) == LCD_SCAN_FREQ_256HZ) || \
                                        ((__FREQ__) == LCD_SCAN_FREQ_512HZ))

#define IS_LCD_BIAS(__BIAS__)         (((__BIAS__) == LCD_BIAS_1_4) || \
                                       ((__BIAS__) == LCD_BIAS_1_3) || \
                                       ((__BIAS__) == LCD_BIAS_1_2))

#define IS_LCD_DUTY(__DUTY__)         (((__DUTY__) == LCD_DUTY_STATIC)  || \
                                       ((__DUTY__) == LCD_DUTY_1_2)     || \
                                       ((__DUTY__) == LCD_DUTY_1_3)     || \
                                       ((__DUTY__) == LCD_DUTY_1_4)     || \
                                       ((__DUTY__) == LCD_DUTY_1_6)     || \
                                       ((__DUTY__) == LCD_DUTY_1_8))

#define IS_LCD_BIAS_SRC(__SOURCE__)   (((__SOURCE__) == LCD_BIAS_SOURCE_INTERNAL_RESISTANCE) || \
                                       ((__SOURCE__) == LCD_BIAS_SOURCE_EXTERNAL_RESISTANCE) || \
                                       ((__SOURCE__) == LCD_BIAS_SOURCE_EXTERNAL_CAPACITANCE))

#define IS_LCD_CONTRAST(__CONTRAST__) (((__CONTRAST__) == LCD_CONTRASTLEVEL_0) || \
                                       ((__CONTRAST__) == LCD_CONTRASTLEVEL_1) || \
                                       ((__CONTRAST__) == LCD_CONTRASTLEVEL_2) || \
                                       ((__CONTRAST__) == LCD_CONTRASTLEVEL_3) || \
                                       ((__CONTRAST__) == LCD_CONTRASTLEVEL_4) || \
                                       ((__CONTRAST__) == LCD_CONTRASTLEVEL_5) || \
                                       ((__CONTRAST__) == LCD_CONTRASTLEVEL_6) || \
                                       ((__CONTRAST__) == LCD_CONTRASTLEVEL_7) || \
                                       ((__CONTRAST__) == LCD_CONTRASTLEVEL_8) || \
                                       ((__CONTRAST__) == LCD_CONTRASTLEVEL_9) || \
                                       ((__CONTRAST__) == LCD_CONTRASTLEVEL_10) || \
                                       ((__CONTRAST__) == LCD_CONTRASTLEVEL_11) || \
                                       ((__CONTRAST__) == LCD_CONTRASTLEVEL_12) || \
                                       ((__CONTRAST__) == LCD_CONTRASTLEVEL_13) || \
                                       ((__CONTRAST__) == LCD_CONTRASTLEVEL_14) || \
                                       ((__CONTRAST__) == LCD_CONTRASTLEVEL_15))


#if defined(LCD_CR_VSEL)
#define IS_LCD_VOLTAGE_SOURCE(__SOURCE__) (((__SOURCE__) == LCD_VOLTAGE_SOURCE_VCCA) || \
                                           ((__SOURCE__) == LCD_VOLTAGE_SOURCE_2P6) || \
                                           ((__SOURCE__) == LCD_VOLTAGE_SOURCE_2P74) || \
                                           ((__SOURCE__) == LCD_VOLTAGE_SOURCE_2P88) || \
                                           ((__SOURCE__) == LCD_VOLTAGE_SOURCE_3P02) || \
                                           ((__SOURCE__) == LCD_VOLTAGE_SOURCE_3P16) || \
                                           ((__SOURCE__) == LCD_VOLTAGE_SOURCE_3P3)  || \
                                           ((__SOURCE__) == LCD_VOLTAGE_SOURCE_3P44) || \
                                           ((__SOURCE__) == LCD_VOLTAGE_SOURCE_3P58))
#else
#define IS_LCD_VOLTAGE_SOURCE(__SOURCE__) (((__SOURCE__) == LCD_VOLTAGE_SOURCE_VCCA))
#endif

#define IS_LCD_COMSEGDRIVE_TYPE(__TYPE__) (((__TYPE__) == LCD_COMSEGDRIVE_TYPE_A) || \
                                           ((__TYPE__) == LCD_COMSEGDRIVE_TYPE_B))


#define IS_LCD_FASTCHARGE_CYCLE(__CYCLE__) (((__CYCLE__) == LCD_FASTCHARGE_CYCLE_1_2) || \
                                            ((__CYCLE__) == LCD_FASTCHARGE_CYCLE_1_4) || \
                                            ((__CYCLE__) == LCD_FASTCHARGE_CYCLE_1_8) || \
                                            ((__CYCLE__) == LCD_FASTCHARGE_CYCLE_1_16) || \
                                            ((__CYCLE__) == LCD_FASTCHARGE_CYCLE_1_32) || \
                                            ((__CYCLE__) == LCD_FASTCHARGE_CYCLE_1_64)  || \
                                            ((__CYCLE__) == LCD_FASTCHARGE_CYCLE_1_128))

#define IS_LCD_CHARGEPUMP_FREQ(__FREQ__) (((__FREQ__) == LCD_CHARGEPUMP_FREQ_512HZ) || \
                                          ((__FREQ__) == LCD_CHARGEPUMP_FREQ_1024HZ) || \
                                          ((__FREQ__) == LCD_CHARGEPUMP_FREQ_2048HZ) || \
                                          ((__FREQ__) == LCD_CHARGEPUMP_FREQ_4096HZ) || \
                                          ((__FREQ__) == LCD_CHARGEPUMP_FREQ_8192HZ) || \
                                          ((__FREQ__) == LCD_CHARGEPUMP_FREQ_16384HZ))

