xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_lcd.h
#define IS_LCD_CHARGEPUMP_SETTIME(__SETTIME__) (((__SETTIME__) == LCD_CHARGEPUMP_SETTIME_256CLOCK) || \
                                                ((__SETTIME__) == LCD_CHARGEPUMP_SETTIME_512CLOCK) || \
                                                ((__SETTIME__) == LCD_CHARGEPUMP_SETTIME_1024CLOCK) || \
                                                ((__SETTIME__) == LCD_CHARGEPUMP_SETTIME_2048CLOCK))

#define IS_LCD_DEAD_TIME(__TIME__) (((__TIME__) == LCD_DEAD_TIME_0) || \
                                    ((__TIME__) == LCD_DEAD_TIME_1) || \
                                    ((__TIME__) == LCD_DEAD_TIME_2) || \
                                    ((__TIME__) == LCD_DEAD_TIME_3) || \
                                    ((__TIME__) == LCD_DEAD_TIME_4) || \
                                    ((__TIME__) == LCD_DEAD_TIME_5)  || \
                                    ((__TIME__) == LCD_DEAD_TIME_6)  || \
                                    ((__TIME__) == LCD_DEAD_TIME_7))

#define IS_LCD_BLINK_FREQ(__FREQ__) (((__FREQ__) == LCD_BLINK_FREQ_OFF)   || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV1)  || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV2)  || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV3)  || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV4)  || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV5)  || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV6)  || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV7)  || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV8)  || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV9)  || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV10) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV11) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV12) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV13) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV14) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV15) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV16) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV17) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV18) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV19) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV20) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV21) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV22) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV23) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV24) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV25) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV26) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV27) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV28) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV29) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV30) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV31) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV32) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV33) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV34) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV35) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV36) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV37) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV38) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV39) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV40) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV41) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV42) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV43) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV44) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV45) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV46) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV47) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV48) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV49) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV50) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV51) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV52) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV53) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV54) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV55) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV56) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV57) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV58) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV59) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV60) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV61) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV62) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV63) || \
                                     ((__FREQ__) == LCD_BLINK_FREQ_DIV64))


#define IS_LCD_CAPDRIVE_NUMBER(__NUMBER__) (((__NUMBER__) == LCD_CAPDRIVE_NUMBER_4)  || \
                                            ((__NUMBER__) == LCD_CAPDRIVE_NUMBER_8)  || \
                                            ((__NUMBER__) == LCD_CAPDRIVE_NUMBER_16)  || \
                                            ((__NUMBER__) == LCD_CAPDRIVE_NUMBER_32)  || \
                                            ((__NUMBER__) == LCD_CAPDRIVE_NUMBER_64))



#define IS_LCD_MODE(__MODE__)         (((__MODE__) == LCD_MODE_0) || \
                                       ((__MODE__) == LCD_MODE_1))

#define IS_LCD_RAM_REGISTER(__REGISTER__) (((__REGISTER__) == LCD_RAM_REGISTER0)  || \
                                           ((__REGISTER__) == LCD_RAM_REGISTER1)  || \
                                           ((__REGISTER__) == LCD_RAM_REGISTER2)  || \
                                           ((__REGISTER__) == LCD_RAM_REGISTER3)  || \
                                           ((__REGISTER__) == LCD_RAM_REGISTER4)  || \
                                           ((__REGISTER__) == LCD_RAM_REGISTER5)  || \
                                           ((__REGISTER__) == LCD_RAM_REGISTER6)  || \
                                           ((__REGISTER__) == LCD_RAM_REGISTER7)  || \
                                           ((__REGISTER__) == LCD_RAM_REGISTER8)  || \
                                           ((__REGISTER__) == LCD_RAM_REGISTER9)  || \
                                           ((__REGISTER__) == LCD_RAM_REGISTER10) || \
                                           ((__REGISTER__) == LCD_RAM_REGISTER11) || \
                                           ((__REGISTER__) == LCD_RAM_REGISTER12) || \
                                           ((__REGISTER__) == LCD_RAM_REGISTER13) || \
                                           ((__REGISTER__) == LCD_RAM_REGISTER14) || \
                                           ((__REGISTER__) == LCD_RAM_REGISTER15))


/**
  * @}
  */
  
/* Exported functions ------------------------------------------------------- */

/** @defgroup LCD_Exported_Functions LCD Exported Functions
  * @{
  */

/** @defgroup LCD_Exported_Functions_Group1 Initialization and de-initialization methods
  * @{
  */

